{
  "title": "Give it up for Peace",
  "date": "October 1st, 2018",
  "thumbnail": "/images/uploads/peace-geeks.png",
  "category": "Social Impact",
  "next": "2018-10-03-shoelessjo",
  "body": "On Monday evening I went to the launch of the PeaceGeeks' #Giveitup4Peace campaign.  The idea is to encourage people to think of something that they 'cannot give up'... and then proceed to give it up for the month.  I am not sure if it is intentionally occurring over Thanksgiving, but it seems appropriate at this time of year to do something that makes us more acutely aware and appreciative of things that we take for granted.  While I have great admiration for the organization, I hadn't actually intended on giving up anything for peace.  I am generally not comfortable with fundraising and there wasn't anything offhand that I was willing to give up that didn't seem superficial.  There were lots of things I could give up with little effort, but nothing that seemed to be significant that I was willing to actually go through with.  It was fun to hear some ideas of what people were giving up - both things that I thought were great but would be too hard for me (like sugar or hot showers - both of which would actually do me a world of good)... or they were too easy to make it meaningful.  I could think of a few things that sounded ambitious that were actually very easy for me (like driving or cell phones) but this seemed ingenuous.  Over the evening, however, I came up with an idea that seemed intriguing - something that would both reflect the reality of life for some people, difficult enough to be a genuine challenge, crazy enough to get some attention, but not ultimately so difficult that it couldn't be done without simply an ongoing willingness to put up with some discomfort.  The idea I had was to give up 'footwear' for the month !  It would be easy to technically give up 'shoes' (ie wear sandals) for a month, but going barefoot would be a serious challenge, but one that I thought I might be able to pull off.</p><p>Almost immediately, I was faced with the reality that this would not actually be allowed (or cool) in a lot of public places - particularly restaurants, but the real challenge was actually going shoeless outside - not inside, so this seemed a bit of a red herring.  So if I adapted my sacrifice to using no footwear while getting around (ie outside), then this was in fact the biggest challenge and the part that I could get away with without being highly inappropriate.  'Footwear while getting around' is not quite as catchy from a soundbite point of view, so I will simply say I am giving up 'footwear*' (with the asterisk alluding to the fact that there is some fine print involved :-)</p><p>Leaving the party that night, I was immediately faced with another issue I hadn't immediately considered.  I had biked to the event downtown, but I had a flat tire, so would have to walk home through a few blocks in the downtown eastside.  While I am normally quite comfortable walking through this area and do not consider it unsafe by most standards, there is an abundance of filth and a real possibility of encountering needles & broken glass - none of which was worth dealing with, even for a worthwhile cause.... so I pumped up my tires before leaving and rode (barefoot) my bike through this area for a few blocks until I was close to the seawall.  When I dismounted, my tire was flat again, but I was now in an area where the sidewalks were clean and I felt comfortable returning home on foot.  It was a bit cold, but entirely tolerable.  When I left the party, I was still a bit unsure of the idea or if I would give it a serious attempt, but by the time I got home I was inspired to give it a go.  I am not sure if I will last the full month since October can get pretty cold, but I thought I should to hold out for a week and see how it goes.<p><p>Game on!</p>"
}