{
  "title": "Shoeless Jo",
  "date": "October 3rd, 2018",
  "thumbnail": "/images/uploads/peace-geeks.png",
  "category": "Social Impact",
  "body": "<a href='https://rans-blog.netlify.com/blog/2018-10-01-giveitup4peace'>Previous Page</a><p /><p>While I was envisioning a few very cold bike rides downtown and along the seawall - hopefully in the sunshine, my barefoot adventure was put to the test early on as I ended up going to visit my mom & sister for an early thanksgiving on my first full day.  This entailed not only venturing out in the early morning chill, but a full complement of transportation forms - walking, bus, skytrain and ferry...</p><p>I am generally not overly self-conscious and I don't normally give much thought to people who think I might be crazy for walking around the seawall in shorts and bare feet, but it is hard not to feel strange when you walk onto the bus and skytrain sin zapatos.  It would actually be easier if the people who noticed (and most people definitely notice) just said something like &#34;Hey dude - why aren't you wearing shoes!&#34;.  But this is Vancouver, so people just glance regularly at your feet and avoid eye contact.  I imagined that many people thought I was newly homeless.  I didn't yet look like I had crawled out of a dumpster, but it was surely only a matter of time... and if they spoke to me, I might be encouraged to ask them for a quarter or a loonie - so better not to make contact.</p><p>At least it was a relatively nice day, so with my rolled up jeans I was still hoping I simply looked like I had just come strolling in off the beach, but not sure I pulled it off.</p><p>Aside from a slight feeling of embarrassment, things were going pretty well until I got onto the ferry.  I had actually figured I was home free once I hit the ferry, since I was, after all, heading to the gulf islands, where hippies are in abundance - escaping from the evils of the city, the free market and rampant capitalism... at least the ones that haven't transformed themselves into rampant free market capitalists.... so I thought I would be in good company.  Here I would risk standing out more conspicuously by wearing a pair of dress pants.</p><p>Alas, just as I approached what I had envisioned was the 'free spirit zone' I was called out.  The ferry staff informed me that I would not be permitted to board the ferry without shoes!</p><p>While it was a bit strange to be called out, it was not entirely unexpected.  I had always assumed I would have to wear shoes in restaurants and many other public places where it would be both socially uncool, and regulatorily unacceptable to go shoeless.  For this reason, I carry around a pair of sandals in my pack (so technically I remain shoeless), but as discussed the footwear ban is primarily intended for getting around town.... so I boarded the ferry with my sandals and found myself shod when I went for my morning coffee ... so I lost my chance to go for a 'shoeless jo' :-), and for the duration of the sailing journey I was back in the land of the normal people ... at least for the time being</p><p>It is just too good not to point out that the way I am writing this blog, I am creating small json files that are auto-loaded into the blog.  This would be boring and useless information if it were not for the fact that I have unwittingly called this file 'shoelessjo.json' - a shamelessly nerdy pun that I am quite proud of, and which had me laughing out loud in the coffee shop as I noticed this fact.</p>"
}