{
  "title": "Life 3.0",
  "date": "October 2nd, 2018",
  "thumbnail": "/images/uploads/life3.0.jpg",
  "category": "Books",
  "body": "<p>Quite a fascinating book talking about the potential for artificial intelligence to catapult us into a period of unimaginable technilogical advance consistent with reaching the point of 'singularity' where computers capable of reproducing improved versions of themselves.  The iconcept is that this creates a positive feedback loop resulting in an explosion in technological development that would dwarf what we have thought to be impressive over the last 50 years.  The point is not to try to prevent this or become alarmist, but to do everything we can at an early stage to ensure that the products of such advances are shared among the community in ways that can transform life for the better.  It is an optimistic idea, particularly in such a disturbing political climate that we find ourselves in.  But the alternative is something that is very troubling.  Left unregulated and uncontrolled, the potential for this to empower a those in control of the technology to oppress with impunity is very real, and only just starting to show signs of the wealth inequity that this could cause if not steered towards positive societal benefits.  Overall, a well thought out book on a fascinating subject.</p><p>The title of the book alludes to three fundamental milestones in the evolution of life.  The first (life 1.0) was the formation of an entity (the first amoeba and bacteria) that somehow managed to reproduce itself - thus forming the first life forms.  These forms were neither able to alter their physical form or genetics, nor were they able to adapt or learn.  This was something that arose much later - a life form (life 2.0) that somehow managed to not only reproduce itself, but to alter its own capabilities through the learning process.  A bacteria cannot 'grow up' and learn to do something new.  Its actions are hard-wired into its DNA.  But life 2.0 was able to improve its capabilities over time.  Humans demonstrate an extreme example of an organism that is capable of feats unimaginable for it to perform at birth.  However, we are still limited by the makeup of our bodies - our DNA and the organs that we are born with.  This line is gradually blurring, however, as we are now able to produce artificial organs and limbs, thus adapting our 'hardware' to some extent.  Life 3.0 arrives when a life form is capable of not only learning over time (or adapting its 'software'), but also adapting its form ('hardware') to improve its capabilities.  It is also an interesting question as to whether something has to be organic to qualify as a life form.  Perhaps - as the book suggests at one point - that this idea is 'specist' prejudicing us against other potential life forms simply because we don't recognize their qualities in ourselves.  Regardless of the symantics, there is a possibilty that computers may attain life 3.0 (defined arbitrarily in the book as an entity that can reproduce itself, adapt its 'software' (ie learning), and adapt its 'hardware' (ie physical form) over its lifetime.  This may or may not happen, and is likely to take decades or perhaps even centuries, but it presents a fascinating topic that is well explored in this book.</p>"
}