{
  "title": "Colombia - Setting Out",
  "date": "Feb 20, 2019",
  "thumbnail": "/images/uploads/toColombia.png",
  "category": "Travel",
  "body": "<p>I used to keep a journey when I travelled back in the old days when people still knew how to use a pen & paper.  I seem to have forgotten as well, since I haven't kept up this practice for some time.  I never really got the same satisfaction out of typing things out into a digital blog despite the fact that it can be faster and easier... but that is a topic of another discussion.<br/><br/>This is an attempt to start back at that process again...<br/><br/>I tend to prefer escaping from the often long drizzly cold winters in Vancouver, though I have rarely found them as endless and depressing as is sometimes its reputation.</p><p>This time I decided on Colombia - primarily Medellin, a city renowned for having a year-round near perfect temperature in the 20s - for a remote working stint.<br/><br/>Ironically, just before leaving Vancouver was completely socked in with 2 days of relentless snow.  It was fantastic.  Ironically, this is something that I don't seek to escape from.  I love it when Vancouver is brought to a standstill by a few inches of snow that covers the streets in a powder that sometimes makes it possible to ski down the sidestreets for days.<br/><br/>In some ways, it was perfect to have 2 days to enjoy the snow and at the same time appreciate even more the warm climate I was soon to be basking in.</p><p>As usual, despite being primarily organized beforehand the night before left little time for sleep, scrambling around trying to do all of the imperceptible, easy-to-forget things around the house that needed doing... but in the end I made it onto the first skytrain of the day (4:55am from Broadway station)  I didn't chance it with the buses - especially given the snow conditions, so I just walked to Cambie St to catch the reliable skytrain directly to the airport - one of the side benefits of hosting the rather expensive 2010 Olympics.<br/><br/>The plane was slightly delayed by the weather but not by much, so I wasn't too worried about making my fairly slim connection in Toronto (1 hour 20 minutes).</p><p>Having only carry on luggage, I was a little concerned that there was an announcement that there may not be space for all of the 'carry-on luggage', requesting volunteers to have their bags checked at no charge to their final destination.  I would have volunteered except that I had narrow time window on the other end.  I also thought it would be prudent to not be the last person on board since my luggage was already pushing the envelope to bursting of what was allowed as carry-on.  Unfortunately my zone was called last, and then to top it off as the last of the passengers entered the overhead gate, I realized that I had left my phone charging in the waiting area.  This of course won't surprise anyone that knows me, but I was at least very thankful that I hadn't realized it 20 minutes later when the plane had left the gate (something I had done in Bangkok once before)  Luckily the flight attendant helped me to stash my larger pack up front and I was able to stash my oversized laptop bag under the seat in front - something that was made easier by the fact that I had scored an exit row seat at the last minute.<br/><br/>We ended up leaving a little late, but only by about 15 minutes so I wasn't too concerned about the delay. I was still hopeful that we would arrive in Bogota in time for me to catch the last bus to town.  (at least the last direct bus that would drop me within a short walk of my airbnb)  I was quite happy to take public transport rather than a cab if the connection was good.  I didn't really feel like getting to know the city buses by transferring to different bus stops late at night in a new city, but had no hesitation in catching one leaving from the airport that could deposit me so close to my destination.  It seems that the last bus departs from the airport about an hour after my flight was set to arrive, so this seemed quite doable, especially conidering that I only had carry-on luggage.<br/><br/>As we arrived, however, it appears that we lost slightly more time, and then ended up circling the city for an additional 20 minutes.  In the end we had about 10-15 minutes after landing before the other flight was set to depart.  To make matters worse, it was at a far-flung gate, on the nether regions of the International Terminal - quite a long walk from the Domestic gate where we were deplaned.  Luckily there were a number of people headed for the same flight so I was fairly confident that they would hold off for an extra 15 minutes or so, but nevertheless I found myself spped-walking and trotting most of the way, and managed to get onto the plane just in time... or so it seemed.</p>"
}